[
	{
		"post_id": "1700444667940",
		"category_id": "1700446535950",
		"topic_id": "1700446682860",
		"featured": "TRUE",
		"img": "Ep174-1.jpeg",
		"title": "Redeeming Heartache: Trauma is Profound, Healing is Possible",
		"text": "Part of what it means to be human is to suffer, but there’s a way to move through it that brings joy and goodness to both you and the world around you.” Dan Allender and Cathy Loerzel. We all endure trauma—either Big T or Little T. We all seek healing. Yet all too often, the defense mechanisms we constructed to survive trauma, now keep us constrained. Join us to consider: Who we are meant to become in the midst of our heartaches. That we’ve all been orphaned, estranged, and widowed due to trauma and loss. How we can bring goodness and joy to others as we move through pain. According to Dan, “Every one of us suffers, yet our suffering is never meant to be only ours—we’re meant to not only join our own transformation, but also in the privilege of being able to join in others’ transformations.” If you’re hurting, you’ll feel a balm of empathy in Dan and Cathy’s words. Please join us for a tender, loving, healing conversation.",
		"content": "<p>Part of what it means to be human is to suffer, but there’s a way to move through it that brings joy and goodness to both you and the world around you.” Dan Allender and Cathy Loerzel. We all endure trauma—either Big T or Little T. We all seek healing. Yet all too often, the defense mechanisms we constructed to survive trauma, now keep us constrained. Join us to consider: Who we are meant to become in the midst of our heartaches. That we’ve all been orphaned, estranged, and widowed due to trauma and loss. How we can bring goodness and joy to others as we move through pain. According to Dan, “Every one of us suffers, yet our suffering is never meant to be only ours—we’re meant to not only join our own transformation, but also in the privilege of being able to join in others’ transformations.” If you’re hurting, you’ll feel a balm of empathy in Dan and Cathy’s words. Please join us for a tender, loving, healing conversation.</p>",
		"audio": "be856193-f1a5-a580-5e6f-59ff641e5707.m4a",
		"url": "https://podcasts.apple.com/us/podcast/love-life-with-dr-karin/id1183475201",
		"created_at": "2021-12-17T19:35:10.709Z",
		"updated_at": "2023-11-20T01:30:34.614Z"
	},
	{
		"post_id": "1700444667941",
		"category_id": "1700446535951",
		"topic_id": "1700446682861",
		"featured": "FALSE",
		"img": "elmer-canas-hTrc3aG3OGY-unsplash-e1629743443998.jpg",
		"title": "Wisdom of the Collective Mother",
		"text": "These past 18 months have been hard. Hard on a personal level, hard on a professional level, and hard on a collective level. The pandemic has disconnected so many of us from the embodied wisdom of community, friendships, and relationships. We have needed to be physically removed for safety, but also we have been separated based on ideologies and deep skisms that have life and death seemingly attached to them. We are divided and skeptical and don’t know where to turn. The toll has been brutal and severe. Even more than we know at this point. We need care, wisdom, and direction as we navigate a complex, heartbreaking, and ever-changing world. We need wise elders and people who have come before us who can steady the ship and set a new course.",
		"content": "<div class=\"entry-content container container-small clear\"> <p>These past 18 months have been hard. Hard on a personal level, hard on a professional level, and hard on a collective level. The pandemic has disconnected so many of us from the embodied wisdom of community, friendships, and relationships. We have needed to be physically removed for safety, but also we have been separated based on ideologies and deep skisms that have life and death seemingly attached to them. We are divided and skeptical and don&#8217;t know where to turn. The toll has been brutal and severe. Even more than we know at this point. We need care, wisdom, and direction as we navigate a complex, heartbreaking, and ever-changing world. We need wise elders and people who have come before us who can steady the ship and set a new course. <span id=\"more-15768\"></span></p> <p>For me, I found myself longing for a grandmother. A wise guide who would invite me into her home, make me tea, and teach me the art of making bread or a delicious berry pie. I longed for her to listen to my plight, my confusion, and my heartache and tell me how it was all going to be ok. I wanted her to remind me of who I am and who I could become. I longed for her to see my face, realize I was exhausted, take me to her spare bedroom, and invite me to rest while the bread baked. And while my fantasy was rich and lovely, I knew in my heart that no one was coming. There was no magical grandmother that could help me navigate this season of my life and I was alone. I was alone to read the books, glean the wisdom I needed, and try to decipher the code coming through my many screens and texts.</p> <p>But it was not working. I was desperate, and words on my own were not enough. Then this past winter, as much of my world was falling apart, I began the bold move of gathering with some women from my church. I had been isolated, in a deep season of turmoil and trauma, and needed a community of women who were committed to seeing the fullness of the world and would also place pillows under my body as I hit the bottom. We were each heartbroken in some way and left to navigate the season without a wise mother to guide us through. We were often wandering rudderless to make our own way. But as we met and talked, we realized that between all of our experiences of sorrow, grief, and heartache, there was one wise woman. <i>We </i>were the wise guide we needed.</p> <p>Collectively, we could hold each other and allow our pieces of wisdom to collide and become whole on behalf of each of us individually. There was enough to go around, and as our friendships progressed, we were able to hold dreams, hopes, calling, grief, fear, and combat curses against our body and souls.</p> <blockquote><p><em><strong>Together, we found the wise woman, and because it was not up to one of us individually, we were able to carry each other&#8217;s burden with ease and compassion. </strong></em></p></blockquote> <p>We were willing to help hold the complexity of who we were without either idealizing our circumstances or dismissing our pain. We were truth tellers and soul tenders, and in the end, I found myself literally being held up by their arms, floating in a pool, and grieving years of painful failure and loss.</p> <p>Together, they were strong enough to hold me, tender enough to wipe my tears, and loving enough to tell me I was good and also enough. It was the embodied wisdom and care I so deeply longed for, and it was utterly life changing. We were the wise woman, and instead of waiting for the non-existent rescuer to appear, we rose up and became what we all needed.</p> <p>Many of us are left desiring a singular person we can fully trust and drop into their wise arms and weep, but what if that which we desire is already here? What if it is not one person but all of us, together, that we really need? If that’s true, then we can be human sized, imperfect, broken, needy, and wise all at the same time. We don’t need to be heroic or all knowing, but we do need to be brave enough to risk presence and be available with whatever we can offer. If we can trust that those parts are enough, we can find a deep well of wisdom residing in the power of the women in our midst. We are the mothers we need; we are the wisdom that is born of suffering and loss. Together, we are enough.</p></div>",
		"url": "https://redtentliving.com/2021/09/13/wisdom-of-the-collective-mother/",
		"created_at": "2021-09-13T19:35:10.709Z",
		"updated_at": "2023-11-20T01:30:34.614Z"
	},
	{
		"post_id": "1700444667942",
		"category_id": "1700446535952",
		"topic_id": "1700446682860",
		"featured": "FALSE",
		"img": "cathy-square.jpg",
		"title": "What Is Story Work?",
		"text": "Cathy answers the question: What is story work?",
		"video": "d1dde7904c",
		"url": "https://vimeo.com/607537276/d1dde7904c",
		"created_at": "2020-10-30T19:35:10.709Z",
		"updated_at": "2023-11-20T01:30:34.614Z"
	},
	{
		"post_id": "1700444667943",
		"category_id": "1700446535950",
		"topic_id": "1700446682862",
		"featured": "FALSE",
		"img": "Season-3-Episode-Art-795-X-500-1.png",
		"title": "Warfare Part 9: Soul Ties",
		"text": "Season 3 concludes with the final episode on Warfare. I am joined again by Cathy Loerzel to talk about soul ties—what they are and how they are formed. In the previous episode we looked at how curses lead to agreements which lead to vows. Today, we look at how this progression can result in a soul tie with the person who has harmed us. In today’s episode, we also address how to break curses, agreements, vows, and soul ties.",
		"content": "<p>Season 3 concludes with the final episode on Warfare. I am joined again by Cathy Loerzel to talk about soul ties—what they are and how they are formed. In the previous episode we looked at how curses lead to agreements which lead to vows. Today, we look at how this progression can result in a soul tie with the person who has harmed us. In today&#8217;s episode, we also address how to <i>break</i> curses, agreements, vows, and soul ties.</p>",
		"audio": "Cathy_Loerzel_Soul_Ties.mp3",
		"url": "https://adamyoungcounseling.com/2020/03/15/warfare-part-9-soul-ties/",
		"created_at": "2020-03-15T19:35:10.709Z",
		"updated_at": "2023-11-20T01:30:34.614Z"
	},
	{
		"post_id": "1700444667944",
		"category_id": "1700446535951",
		"topic_id": "1700446682861",
		"featured": "FALSE",
		"img": "https://cdn.theallendercenter.org/wp-content/uploads/2015/09/Gizmo.jpg",
		"title": "Goodbye Old Friend",
		"text": "In the chaos and urgency of tragedy, it is difficult to slow down and allow ourselves to grieve. As our adult self makes decisions and takes action, can we still let ourselves feel the sadness, fear, and loneliness of our inner child? That was the gut-wrenching challenge faced by Cathy Loerzel, Executive Director of The Allender Center after a personal tragedy struck in the summer of 2015.",
		"content": "<div class=\"the-content\"><p>In the chaos and urgency of tragedy, it is difficult to slow down and allow ourselves to grieve. As our adult self makes decisions and takes action, can we still let ourselves feel the sadness, fear, and loneliness of our inner child? That was the gut-wrenching challenge faced by <a href=\"http://theseattleschool.edu/directory/loerzel-cathy/\" target=\"_blank\" rel=\"noopener noreferrer\">Cathy Loerzel</a>, Executive Director of The Allender Center after a personal tragedy struck in the summer of 2015.</p><hr /><p>Two days ago, my one-and-a-half year-old son was playing in our living room, and I heard the loud growl and jaw snap of my beloved dog Gizmo, quickly followed by the piercing screams of my baby. My body went cold as I leapt over the couch to reach my son, only to see his forehead bleeding and three other teeth marks lodged far too near to his sweet, precious blue eyes. I pulled Liam into my arms, and my husband quickly pulled Gizmo outside as I tended to our son.</p><p><span style=\"font-weight: 400;\">Liam sobbed uncontrollably, tears rolled down my face, and my husband started to assess the severity of our son’s wounds. As we realized the wounds were superficial and Liam would be okay, the reality of what had just transpired began to sink into my heart.</span></p><p><span style=\"font-weight: 400;\">You see, Liam loves our dog. Gizmo is fluffy and loyal and has been a constant source of delight and fascination for his young and sweet heart. He is an old, big, lumbering dog who is in a great deal of pain and has become increasingly sensitive as his body deteriorates. Gizmo is also the dog that I got from the pound when I completed graduate school. He has been my sweet companion, protector, and comforter for the last eight years of my life. I love him with all that I am. He has seen me through break-ups, best friends moving out, my first Christmas on my own, getting married, and having my first baby. If you ever needed to find me, you could just look for the big golden dog at my feet.</span></p><p><span style=\"font-weight: 400;\">The horror of seeing something I love so much harm my baby caused my heart to break in five different ways, and the reality of what this inevitably means makes we want to sob from the depths of my heart. For those of you who have never loved a pet, this may seem absurd to you. And of course, the safety of my baby will trump all other things, but the agony of the unavoidable loss of my dog is almost unbearable.  </span></p><p><span style=\"font-weight: 400;\">As I thought about the fact that I will have to say goodbye to this love of my life, I realized this grief has a different feel than other grief I’ve experienced. I think our hearts have different memories and different compartments that are connected to our stories of loss. This particular loss is connected to my little girl heart that loved her doggy. It is my little girl heart that is breaking and my little girl heart that is losing her companion and protector.  </span></p><p><span style=\"font-weight: 400;\">My little girl heart is fragile and scared, and this big fluffy dog gave her comfort when her woman heart just could not hold all the fear. When I was scared at night the first time I slept in my townhouse alone, I crawled onto the floor with Gizmo and buried my face in his soft fur and cried. His long body held me and offered me comfort and fur to wipe my tears. He was the one that woke me up every morning during difficult seasons, circling my bed to beckon for a walk. I did not have to take walks alone because he was with me, I did not have to sleep in a tent alone because he was by my side, keeping me warm and warding away danger. He calmed me when I was sad or anxious, and he laid with me when I broke my foot and was alone on the couch all day. He was by my side late at night when I could not sleep during my last trimester of pregnancy. And when Liam was born, Gizmo was with me at 2 a.m. feedings. He could sense our vulnerability and fiercely protected us from those who approached until he could tell if they were friends or foes.  </span></p><p><span style=\"font-weight: 400;\">He has been the protector of my little girl heart and has loved me with a knowing and loyal soul. And now…now, he is old and in pain and has harmed my sweet son. There is no way I can put words to this heartache. My momma heart is solemn and steadfast and will protect my baby, but my little girl heart is broken and weeping on the floor.   </span></p><p><span style=\"font-weight: 400;\">I don’t know how to bear this level of heartache, and I don’t know how to make the final decision to say goodbye. I know I have to—I will choose well with bravery and honor and say goodbye to my dog, but I will also allow my little girl heart to weep in utter despair at the loss of her beloved soul friend. Gizmo—my sweet pup—I will love you forever, and I’m so grateful for how you have loved me and so grateful for how much I got to love you. You are the best dog I will ever have. Please tell Jesus all about our grand adventures and save a spot for me in heaven.  </span></p><p><i><span style=\"font-weight: 400;\">Note: Gizmo died a beautiful and honorable death on June 12, 2015. He died in my arms and in our backyard, covered with sweet tears of love and gratitude.</span></i><span style=\"font-weight: 400;\">  </span></p></div>",
		"url": "https://theallendercenter.org/2015/09/goodbye-old-friend/",
		"created_at": "2015-09-10T19:35:10.709Z",
		"updated_at": "2023-11-20T01:30:34.614Z"
	}
]
